In [1]:
import pandas as pd

In [3]:
#load csv file
pd.read_csv("student_dataset.csv")

       ID          Name  Age  Marks  Gender
0       1     Student_1   24     94    Male
1       2     Student_2   21     81  Female
2       3     Student_3   22     90    Male
3       4     Student_4   24     56  Female
4       5     Student_5   20     44  Female
..    ...           ...  ...    ...     ...
995   996   Student_996   23     82  Female
996   997   Student_997   18     73  Female
997   998   Student_998   24     96  Female
998   999   Student_999   21     65    Male
999  1000  Student_1000   23     80    Male

[1000 rows x 5 columns]

In [7]:
data = {
    'Name': ['Kaveri', 'Vaishu', 'Simran', 'Sayli', 'Arati', 'Anu'],
    'Age': [18, 17, 20, 21, 22, 25],
    'Marks': [99, 56, 87, 90, 32, 77]
}

df = pd.DataFrame(data)

print("Pandas DataFrame:")
print(df)

print("\nAccess single column (as Series):")
print(df['Marks'])

Pandas DataFrame:
     Name  Age  Marks
0  Kaveri   18     99
1  Vaishu   17     56
2  Simran   20     87
3   Sayli   21     90
4   Arati   22     32
5     Anu   25     77

Access single column (as Series):
0    99
1    56
2    87
3    90
4    32
5    77
Name: Marks, dtype: int64

In [9]:
df.head()        # first 5 rows

     Name  Age  Marks
0  Kaveri   18     99
1  Vaishu   17     56
2  Simran   20     87
3   Sayli   21     90
4   Arati   22     32

In [10]:
df.tail()        # last 5 rows

     Name  Age  Marks
1  Vaishu   17     56
2  Simran   20     87
3   Sayli   21     90
4   Arati   22     32
5     Anu   25     77

In [11]:
df.shape         # (rows, columns)

(6, 3)

In [12]:
df.info()        # summary (data types, non-null count)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   Marks   6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

In [13]:
df.dtypes        # data types of each column

Name     object
Age       int64
Marks     int64
dtype: object

In [14]:
df.describe()    # summary statistics (mean, std, min, max, etc.)

             Age      Marks
count   6.000000   6.000000
mean   20.500000  73.500000
std     2.880972  25.081866
min    17.000000  32.000000
25%    18.500000  61.250000
50%    20.500000  82.000000
75%    21.750000  89.250000
max    25.000000  99.000000

In [15]:
df.columns       # list of column names

Index(['Name', 'Age', 'Marks'], dtype='object')

In [16]:
df.index      #index of dataframe

RangeIndex(start=0, stop=6, step=1)

In [17]:
df.describe()
df['Marks'].mean()

np.float64(73.5)

In [18]:
df['Marks'].median()   # median

np.float64(82.0)

In [19]:
df['Marks'].max()      # maximum value

np.int64(99)

In [20]:
df['Marks'].min()      # minimum value

np.int64(32)

In [21]:
df['Marks'].sum()      # sum of column

np.int64(441)

In [22]:
df['Marks'].value_counts()  # frequency count

Marks
99    1
56    1
87    1
90    1
32    1
77    1
Name: count, dtype: int64